Revit 2027 API
BuiltInFailures.DimensionFailures.LabelOverconstrained Property
 Labeling this dimension would overconstrain the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LabelOverconstrained { get; }
Public Shared ReadOnly Property LabelOverconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LabelOverconstrained {
	FailureDefinitionId^ get ();
}
static member LabelOverconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace